constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          3456;
        startFace       1020144;
    }
    outlet
    {
        type            patch;
        nFaces          3456;
        startFace       1023600;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9600;
        startFace       1027056;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9600;
        startFace       1036656;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       1046256;
    }
)

// ************************************************************************* //
