constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;

    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;

    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   0.040;
    }
    equationOfState
    {
        rho0        1200;
        T0          300;
        beta        3.6e-4;
    }
    thermodynamics
    {
        Cp          3470;
        Hf          0;
    }
    transport
    {
        mu          0.00185;
        Pr          9.7;
    }
}

// ************************************************************************* //
