0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
    	value		    uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            externalWallHeatFluxTemperature;
				mode						flux;
				kappaMethod			fluidThermo;
				q								uniform -1e5;
				value						$internalField;
    }

    upperWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}



// ************************************************************************* //
